/**
 * 判断url是否是http或https
 */
export function isHttp(url: string) {
  return url.indexOf('http://') !== -1 || url.indexOf('https://') !== -1
}

/**
 * 判断path是否为外链
 */
export function isExternal(path: any) {
  return /^(https?:|mailto:|tel:)/.test(path)
}

export const Regular = {
  //必须带端口号的网址(或ip)
  Url_port:/^((ht|f)tps?:\/\/)?[\w-]+(\.[\w-]+)+:\d{1,5}\/?$/,
  //网址(URL)
  Url:/^(((ht|f)tps?):\/\/)?([^!@#$%^&*?.\s-]([^!@#$%^&*?.\s]{0,63}[^!@#$%^&*?.\s])?\.)+[a-z]{2,6}\/?/,
  //统一社会信用代码
  Social_credit:/^[0-9A-HJ-NPQRTUWXY]{2}\d{6}[0-9A-HJ-NPQRTUWXY]{10}$/,
  //统一社会信用代码(宽松匹配)(15位/18位/20位数字/字母)
  Social_credit2:/^(([0-9A-Za-z]{15})|([0-9A-Za-z]{18})|([0-9A-Za-z]{20}))$/,
  //子网掩码(不包含 0.0.0.0)
  Subnet_mask:/^(254|252|248|240|224|192|128)\.0\.0\.0|255\.(254|252|248|240|224|192|128|0)\.0\.0|255\.255\.(254|252|248|240|224|192|128|0)\.0|255\.255\.255\.(255|254|252|248|240|224|192|128|0)$/,
  //window"文件夹"路径
  window_folder_path:/^[a-zA-Z]:\\(?:\w+\\?)*$/,
  //window下"文件"路径
  window_file_path:/^[a-zA-Z]:\\(?:\w+\\)*\w+\.\w+$/,
  //html注释
  Html_comments:/<!--[\s\S]*?-->/g,
  //md5格式(32位)
  md5_32:/^[a-fA-F0-9]{32}$/,
  //GUID/UUID
  GUID_UUID:/^[a-f\d]{4}(?:[a-f\d]{4}-){4}[a-f\d]{12}$/i,
  //版本号(version)格式必须为X.Y.Z
  Version:/^\d+(?:\.\d+){2}$/,
  //视频(video)链接地址（视频格式可按需增删）
  Video_url:/^https?:\/\/(.+\/)+.+(\.(swf|avi|flv|mpg|rm|mov|wav|asf|3gp|mkv|rmvb|mp4))$/i,
  //图片(image)链接地址（图片格式可按需增删）
  Image_url:/^https?:\/\/(.+\/)+.+(\.(gif|png|jpg|jpeg|webp|svg|psd|bmp|tif))$/i,
  //24小时制时间（HH:mm:ss）
  HH_mm_ss:/^(?:[01]\d|2[0-3]):[0-5]\d:[0-5]\d$/,
  //12小时制时间（hh:mm:ss）
  hh_mm_ss:/^(?:1[0-2]|0?[1-9]):[0-5]\d:[0-5]\d$/,
  //base64格式
  base64:/^\s*data:(?:[a-z]+\/[a-z0-9-+.]+(?:,[a-z-]+:[a-z0-9-]+)?)?(?:,base64)?,([a-z0-9!$&',()*+,:\-._~:@/?%\s]*?)\s*$/i,
  //数字/货币金额（支持负数、千分位分隔符）
  Monetary_amount:/^-?\d+(,\d{3})*(\.\d{1,2})?$/,
  //数字/货币金额 (只支持正数、不支持校验千分位分隔符)
  Just_Monetary_amount:/(?:^[1-9]([0-9]+)?(?:\.[0-9]{1,2})?$)|(?:^(?:0)$)|(?:^[0-9]\.[0-9](?:[0-9])?$)/,
  //银行卡号（10到30位, 覆盖对公/私账户
  Card_No:/^[1-9]\d{9,29}$/,
  //中文姓名
  Chinese_name:/^(?:[\u4e00-\u9fa5·]{2,16})$/,
  //英文姓名
  English_name:/(^[a-zA-Z][a-zA-Z\s]{0,20}[a-zA-Z]$)/,
  //车牌号(新能源)
  License_plate_new:/^[京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领][A-HJ-NP-Z](?:((\d{5}[A-HJK])|([A-HJK][A-HJ-NP-Z0-9][0-9]{4}))|[A-HJ-NP-Z0-9]{4}[A-HJ-NP-Z0-9挂学警港澳])$/,
  //车牌号(非新能源)
  License_plate_no:/^[京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领][A-HJ-NP-Z][A-HJ-NP-Z0-9]{4}[A-HJ-NP-Z0-9挂学警港澳]$/,
  //车牌号(新能源+非新能源)
  License_plate_blend:/^[京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领][A-HJ-NP-Z][A-HJ-NP-Z0-9]{4,5}[A-HJ-NP-Z0-9挂学警港澳]$/,
  //手机号(mobile phone)中国(严谨), 根据工信部2019年最新公布的手机号段
  Mobile_number_China_strict:/^(?:(?:\+|00)86)?1(?:(?:3[\d])|(?:4[5-79])|(?:5[0-35-9])|(?:6[5-7])|(?:7[0-8])|(?:8[\d])|(?:9[189]))\d{8}$/,
  //手机号(mobile phone)中国(宽松), 只要是13,14,15,16,17,18,19开头即可
  Mobile_number_China_easy:/^(?:(?:\+|00)86)?1[3-9]\d{9}$/,
  //手机号(mobile phone)中国(最宽松), 只要是1开头即可, 如果你的手机号是用来接收短信, 优先建议选择这一条
  Mobile_number_China_Most_loose:/^(?:(?:\+|00)86)?1\d{10}$/,
  //日期(宽松)
  Date_easy:/^\d{1,4}(-)(1[0-2]|0?[1-9])\1(0?[1-9]|[1-2]\d|30|31)$/,
  //日期(严谨, 支持闰年判断)
  Date_strict:/^(([0-9]{3}[1-9]|[0-9]{2}[1-9][0-9]{1}|[0-9]{1}[1-9][0-9]{2}|[1-9][0-9]{3})-(((0[13578]|1[02])-(0[1-9]|[12][0-9]|3[01]))|((0[469]|11)-(0[1-9]|[12][0-9]|30))|(02-(0[1-9]|[1][0-9]|2[0-8]))))|((([0-9]{2})(0[48]|[2468][048]|[13579][26])|((0[48]|[2468][048]|[3579][26])00))-02-29)$/,
  //可以被moment转化成功的时间 YYYYMMDD HH:mm:ss
  Time_format:/^\d{4}([/:-\S])(1[0-2]|0?[1-9])\1(0?[1-9]|[1-2]\d|30|31) (?:[01]\d|2[0-3]):[0-5]\d:[0-5]\d$/,
  //email(邮箱)
  Email:/^(([^<>()[\]\\.,;:\s@"]+(\.[^<>()[\]\\.,;:\s@"]+)*)|(".+"))@((\[[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\])|(([a-zA-Z\-0-9]+\.)+[a-zA-Z]{2,}))$/,
  //座机(tel phone)电话(国内),如: 0341-86091234
  Tel_phone_china:/^(?:(?:\d{3}-)?\d{8}|^(?:\d{4}-)?\d{7,8})(?:-\d+)?$/,
  //身份证号(1代,15位数字)
  ID_number1:/^[1-9]\d{7}(?:0\d|10|11|12)(?:0[1-9]|[1-2][\d]|30|31)\d{3}$/,
  //身份证号(2代,18位数字),最后一位是校验位,可能为数字或字符X
  ID_number2:/^[1-9]\d{5}(?:18|19|20)\d{2}(?:0[1-9]|10|11|12)(?:0[1-9]|[1-2]\d|30|31)\d{3}[\dXx]$/,
  //身份证号, 支持1/2代(15位/18位数字)
  ID_number1_2:/^\d{6}((((((19|20)\d{2})(0[13-9]|1[012])(0[1-9]|[12]\d|30))|(((19|20)\d{2})(0[13578]|1[02])31)|((19|20)\d{2})02(0[1-9]|1\d|2[0-8])|((((19|20)([13579][26]|[2468][048]|0[48]))|(2000))0229))\d{3})|((((\d{2})(0[13-9]|1[012])(0[1-9]|[12]\d|30))|((\d{2})(0[13578]|1[02])31)|((\d{2})02(0[1-9]|1\d|2[0-8]))|(([13579][26]|[2468][048]|0[048])0229))\d{2}))(\d|X|x)$/,
  //护照（包含香港、澳门）
  Passport:/(^[EeKkGgDdSsPpHh]\d{8}$)|(^(([Ee][a-fA-F])|([DdSsPp][Ee])|([Kk][Jj])|([Mm][Aa])|(1[45]))\d{7}$)/,
  //中文/汉字
  Chinese:/^(?:[\u3400-\u4DB5\u4E00-\u9FEA\uFA0E\uFA0F\uFA11\uFA13\uFA14\uFA1F\uFA21\uFA23\uFA24\uFA27-\uFA29]|[\uD840-\uD868\uD86A-\uD86C\uD86F-\uD872\uD874-\uD879][\uDC00-\uDFFF]|\uD869[\uDC00-\uDED6\uDF00-\uDFFF]|\uD86D[\uDC00-\uDF34\uDF40-\uDFFF]|\uD86E[\uDC00-\uDC1D\uDC20-\uDFFF]|\uD873[\uDC00-\uDEA1\uDEB0-\uDFFF]|\uD87A[\uDC00-\uDFE0])+$/,
  //小数
  Decimal:/^\d+\.\d+$/,
  //只包含数字
  Number:/^\d+$/,
  //html标签(宽松匹配)
  HTML_easy:/<(\w+)[^>]*>(.*?<\/\1>)?/,
  //匹配中文汉字和中文标点
  Chinese_punctuation:/[\u4e00-\u9fa5|\u3002|\uff1f|\uff01|\uff0c|\u3001|\uff1b|\uff1a|\u201c|\u201d|\u2018|\u2019|\uff08|\uff09|\u300a|\u300b|\u3008|\u3009|\u3010|\u3011|\u300e|\u300f|\u300c|\u300d|\ufe43|\ufe44|\u3014|\u3015|\u2026|\u2014|\uff5e|\ufe4f|\uffe5]/,
  //qq号格式正确
  QQ_number:/^[1-9][0-9]{4,10}$/,
  //数字和字母组成
  Numeric_letters:/^[A-Za-z0-9]+$/,
  //英文字母
  English_letter:/^[a-zA-Z]+$/,
  //小写英文字母组成
  Small_English_letters:/^[a-z]+$/,
  //大写英文字母
  Capital_letters:/^[A-Z]+$/,
  //用户名校验，4到16位（字母，数字，下划线，减号）
  User_name_verification:/^[a-zA-Z0-9_-]{4,16}$/,
  QIP: /^(QIP:)(\d{1,2}|1\d\d|2[0-4]\d|25[0-5])\.(\d{1,2}|1\d\d|2[0-4]\d|25[0-5])\.(\d{1,2}|1\d\d|2[0-4]\d|25[0-5])\.(\d{1,2}|1\d\d|2[0-4]\d|25[0-5])$/,
  //ip-v4[:端口]
  Ipv4:/^((\d|[1-9]\d|1\d\d|2[0-4]\d|25[0-5])\.){3}(\d|[1-9]\d|1\d\d|2[0-4]\d|25[0-5])(?::(?:[0-9]|[1-9][0-9]{1,3}|[1-5][0-9]{4}|6[0-4][0-9]{3}|65[0-4][0-9]{2}|655[0-2][0-9]|6553[0-5]))?$/,
  //ip-v6[:端口]
  Ipv6:/(^(?:(?:(?:[0-9A-Fa-f]{1,4}:){7}[0-9A-Fa-f]{1,4})|(([0-9A-Fa-f]{1,4}:){6}:[0-9A-Fa-f]{1,4})|(([0-9A-Fa-f]{1,4}:){5}:([0-9A-Fa-f]{1,4}:)?[0-9A-Fa-f]{1,4})|(([0-9A-Fa-f]{1,4}:){4}:([0-9A-Fa-f]{1,4}:){0,2}[0-9A-Fa-f]{1,4})|(([0-9A-Fa-f]{1,4}:){3}:([0-9A-Fa-f]{1,4}:){0,3}[0-9A-Fa-f]{1,4})|(([0-9A-Fa-f]{1,4}:){2}:([0-9A-Fa-f]{1,4}:){0,4}[0-9A-Fa-f]{1,4})|(([0-9A-Fa-f]{1,4}:){6}((\b((25[0-5])|(1\d{2})|(2[0-4]\d)|(\d{1,2}))\b)\.){3}(\b((25[0-5])|(1\d{2})|(2[0-4]\d)|(\d{1,2}))\b))|(([0-9A-Fa-f]{1,4}:){0,5}:((\b((25[0-5])|(1\d{2})|(2[0-4]\d)|(\d{1,2}))\b)\.){3}(\b((25[0-5])|(1\d{2})|(2[0-4]\d)|(\d{1,2}))\b))|(::([0-9A-Fa-f]{1,4}:){0,5}((\b((25[0-5])|(1\d{2})|(2[0-4]\d)|(\d{1,2}))\b)\.){3}(\b((25[0-5])|(1\d{2})|(2[0-4]\d)|(\d{1,2}))\b))|([0-9A-Fa-f]{1,4}::([0-9A-Fa-f]{1,4}:){0,5}[0-9A-Fa-f]{1,4})|(::([0-9A-Fa-f]{1,4}:){0,6}[0-9A-Fa-f]{1,4})|(([0-9A-Fa-f]{1,4}:){1,7}:))$)|(^\[(?:(?:(?:[0-9A-Fa-f]{1,4}:){7}[0-9A-Fa-f]{1,4})|(([0-9A-Fa-f]{1,4}:){6}:[0-9A-Fa-f]{1,4})|(([0-9A-Fa-f]{1,4}:){5}:([0-9A-Fa-f]{1,4}:)?[0-9A-Fa-f]{1,4})|(([0-9A-Fa-f]{1,4}:){4}:([0-9A-Fa-f]{1,4}:){0,2}[0-9A-Fa-f]{1,4})|(([0-9A-Fa-f]{1,4}:){3}:([0-9A-Fa-f]{1,4}:){0,3}[0-9A-Fa-f]{1,4})|(([0-9A-Fa-f]{1,4}:){2}:([0-9A-Fa-f]{1,4}:){0,4}[0-9A-Fa-f]{1,4})|(([0-9A-Fa-f]{1,4}:){6}((\b((25[0-5])|(1\d{2})|(2[0-4]\d)|(\d{1,2}))\b)\.){3}(\b((25[0-5])|(1\d{2})|(2[0-4]\d)|(\d{1,2}))\b))|(([0-9A-Fa-f]{1,4}:){0,5}:((\b((25[0-5])|(1\d{2})|(2[0-4]\d)|(\d{1,2}))\b)\.){3}(\b((25[0-5])|(1\d{2})|(2[0-4]\d)|(\d{1,2}))\b))|(::([0-9A-Fa-f]{1,4}:){0,5}((\b((25[0-5])|(1\d{2})|(2[0-4]\d)|(\d{1,2}))\b)\.){3}(\b((25[0-5])|(1\d{2})|(2[0-4]\d)|(\d{1,2}))\b))|([0-9A-Fa-f]{1,4}::([0-9A-Fa-f]{1,4}:){0,5}[0-9A-Fa-f]{1,4})|(::([0-9A-Fa-f]{1,4}:){0,6}[0-9A-Fa-f]{1,4})|(([0-9A-Fa-f]{1,4}:){1,7}:))\](?::(?:[0-9]|[1-9][0-9]{1,3}|[1-5][0-9]{4}|6[0-4][0-9]{3}|65[0-4][0-9]{2}|655[0-2][0-9]|6553[0-5]))?$)/i,
  //16进制颜色
  Hexadecimal_color:/^#?([a-fA-F0-9]{6}|[a-fA-F0-9]{3})$/,
  //微信号(wx)，6至20位，以字母开头，字母，数字，减号，下划线
  Wechat_number:/^[a-zA-Z][-_a-zA-Z0-9]{5,19}$/,
  //邮政编码(中国)
  Postal_Code_China:/^(0[1-7]|1[0-356]|2[0-7]|3[0-6]|4[0-7]|5[1-7]|6[1-7]|7[0-5]|8[013-6])\d{4}$/,
  //中文和数字
  Chinese_numeralsL:/^((?:[\u3400-\u4DB5\u4E00-\u9FEA\uFA0E\uFA0F\uFA11\uFA13\uFA14\uFA1F\uFA21\uFA23\uFA24\uFA27-\uFA29]|[\uD840-\uD868\uD86A-\uD86C\uD86F-\uD872\uD874-\uD879][\uDC00-\uDFFF]|\uD869[\uDC00-\uDED6\uDF00-\uDFFF]|\uD86D[\uDC00-\uDF34\uDF40-\uDFFF]|\uD86E[\uDC00-\uDC1D\uDC20-\uDFFF]|\uD873[\uDC00-\uDEA1\uDEB0-\uDFFF]|\uD87A[\uDC00-\uDFE0])|(\d))+$/,
  //不能包含字母
  Cannot_contain_letters:/^[^A-Za-z]*$/,
  //mac地址
  Mac_url:/^((([a-f0-9]{2}:){5})|(([a-f0-9]{2}-){5}))[a-f0-9]{2}$/i,
  //匹配连续重复的字符
  Continuous_repeating_characters:/(.)\1+/,
  //数字和英文字母组成，并且同时含有数字和英文字母
  Digital_English_Chinese:/^(?=.*[a-zA-Z])(?=.*\d).+$/,
  //香港身份证
  HongKong_Identity_Card:/^[a-zA-Z]\d{6}\([\dA]\)$/,
  //澳门身份证
  Macau_Identity_Card:/^[1|5|7]\d{6}\(\d\)$/,
  //台湾身份证
  Taiwan_ID_card:/^[a-zA-Z][0-9]{9}$/,
  //帐号是否合法(以字母开头，长度在6~18之间，只能包含字母、数字和下划线)
  Account_number:/^[a-zA-Z]\w{5,17}$/,
  //密码强度校验，最少6位，包括至少1个大写字母，1个小写字母，1个数字，1个特殊字符
  Password_strength_check:/^\S*(?=\S{6,})(?=\S*\d)(?=\S*[A-Z])(?=\S*[a-z])(?=\S*[!@#$%^&*? ])\S*$/,
  //大写字母，小写字母，数字，特殊符号 `@#$%^&*`~()-+=` 中任意3项密码
  Password_3:/^(?![a-zA-Z]+$)(?![A-Z0-9]+$)(?![A-Z\W_!@#$%^&*`~()-+=]+$)(?![a-z0-9]+$)(?![a-z\W_!@#$%^&*`~()-+=]+$)(?![0-9\W_!@#$%^&*`~()-+=]+$)[a-zA-Z0-9\W_!@#$%^&*`~()-+=]/,
  //ASCII码表中的全部的特殊字符
  ASCII_special:/[\x21-\x2F\x3A-\x40\x5B-\x60\x7B-\x7E]+/,
  //正整数，不包含0
  Positive_integer_0:/^\+?[1-9]\d*$/,
  //负整数，不包含0
  Negtive_integer_0:/^-[1-9]\d*$/,
  //整数
  Integer:/^(?:0|(?:-?[1-9]\d*))$/,
  //浮点数
  Floating_point_number:/^(-?[1-9]\d*\.\d+|-?0\.\d*[1-9]\d*|0\.0+)$/,
  //浮点数(严格)
  Floating_point_number_strict:/^(-?[1-9]\d*\.\d+|-?0\.\d*[1-9])$/,
  //email(支持中文邮箱)
  Chinese_mailbox:/^[A-Za-z0-9\u4e00-\u9fa5]+@[a-zA-Z0-9_-]+(\.[a-zA-Z0-9_-]+)+$/,
  //域名(非网址, 不包含协议)
  Domain_name:/^([0-9a-zA-Z-]{1,}\.)+([a-zA-Z]{2,})$/
}